# 列表除了可以:
#
# ·定义
# · 使用下标索引获取值
# 以外，列表也提供了一系列功能:
#
# ·插入元素
# ·删除元素
# ·清空列表
# ·修改元素
# ·统计元素个数
#
# 等等功能，这些功能我们都称之为:列表的方法
list1 = [1,2,3,4,5,6,7,8,9]
list2 = [[1,2,3,4,5,6,7,8,9],[10,11,12,13,14,15,16,17,18,19],[20,21,22,23,24,25,26,27],[28,29,30,31,32,33,34,35,36,37,38,39]]
list3 = ["itdaizhitong","itheima","listnumber3"]
# 1.查找某元素的下标
# 功能:查找指定元素在列表的下标，如果找不到，报错ValueError
# 语法:列表.index(元素)
# index就是列表对象(变量)内置的方法(函数)
a = list2.index([1,2,3,4,5,6,7,8,9])
print(a)
# 快捷操作，确定某个函数在列表内,返回一个布尔值
b = 1 in list1
print(b)

# 2.修改特定位置(索引)的元素值:
# 语法:列表[下标]=值
# 可以使用如上语法，直接对指定下标(正向、反向下标均可)的值进行:重新赋值(修改)
list1[4] =999
print(list1)

# 3.插入元素:
# 语法:列表.insert(下标，元素)，在指定的下标位置，插入指定的元素
# 查到哪个下标它就成了哪个下标上的元素
list2.insert(0,"daizhitong")
print(list2)

# 4.追加元素:
# 语法:列表.append(元素)，将指定元素，追加到列表的尾部
list1.append("itheima")
print(list1)
# 追加元素方式2:
# 语法:列表.extend(其它数据容器)，将其它数据容器的内容取出，依次追加到列表尾部
# list1.extend([10,11,12,13,14,15,16,17,18,19])
list1.extend(list2)
print(list1)

# 5.刪除元素:
# 语法1:del列表[下标]
# 语法2:列表.pop[下标]       不同于语法1的删除方式，.pop删除有返回值
del list1[2]
c=list1.pop(0)
print(c)
print(list1)
# 删除某元素在列表中的第一个匹配项
# 语法:列表.remove(元素)

# 清空列表内容，
# 语法:列表.clear()

# 统计某元素在列表内的数量
# 语法:列表.count(元素)

