# 思考:列表是可以修改的。
# 如果想要传递的信息，不被篡改，列表就不合适了。
# 元组同列表一样，都是可以封装多个、不同类型的元素在内。
# 但最大的不同点在于?
# 元组一旦定义完成，就不可修改(但是硬要说的话还有点意外，比如在元组里存在类型为列表的元素，我们可以对这个列表进行修改，也就是说对元素进行了修改)

# 所以，当我们需要在程序内封装数据，又不希望封装的数据被篡改，那么元组就非常合适了

# 元组定义:定义元组使用小括号，且使用逗号隔开各个数据，数据可以是不同的数据类型。

t1 = ('daizhitong',1,2,2,2,2,2,3,True,False,[4,5,6,7],type(6))
print(t1)
# 注意:元组只有一个数据时，这个数据后面要添加逗号，否则就不是元组类型了
t2 = ('zhangwuji',)
print(t2)
print(type(t2))

# 元组相关caozuo
# index()         查找某个数据，如果数据存在返回对应的下标，否则报错
#
# count()         统计某个数据在当前元组出现的次数
#
# len(元组)         统计元组内的元素个数

a = t1.index(2)
print(a)

b =  t1.count(2)
print(b)

c = len(t1)
print(c)

t3 = ('daizhitong',True,False,[4,5,6,7],type(6))
t3[3][2] = 8
t3[3].append(100)
print(t3)

# 元组同列表一样也可以进行遍历操作
for x in t3:
    print(x)
# 或者
index = 0
while index < len(t3):
    print(t3[index])
    index += 1


