# 再识字符串
# 尽管字符串看起来并不像:列表、元组那样，一看就是存放了许多数据的容器。
# 但不可否认的是，字符串同样也是数据容器的一员。
# 字符串是字符的容器，一个字符串可以存放任意数量的字符。
# 和其它容器如:列表、元组一样，字符串也可以通过下标进行访问
# 从前向后，下标从0开始
# 从后向前，下标从-1开始

str = "daizhitong"
print(str[0])
# 同元组一样，字符串是一个:无法修改的数据容器。
# str[0] = "a"
# print(str[0])     会报错

# 虽然字符串的值无法修改，但是可以对字符串进行重新赋值
str = "ELTON"
print(str[0])

# 字符串的常用操作

# 1.查找特定字符串的下标索引值
# 语法:字符串.index(字符串)
a = str.index("O")
print(a)

# 2.字符串的替换
# 语法:字符串.replace(字符串1，字符串2)
# 功能:将字符串内的全部:字符串1，替换为字符串2
# 注意:不是修改字符串本身，而是得到了一个新字符串哦
# 也就是说str本身没有变，只会把新的字符串进行返回
s = str.replace(str, "我是新的字符串")
print(s)

# 3.字符串的分割
# 语法:字符串.split(分隔符字符串)
# 功能:按照指定的分隔符字符串，将字符串划分为多个字符串，并存入列表对象中
# 注意:字符串本身不变，而是得到了一个列表对象
str1 = "按照指定|的分隔符|字符串将|字符串划|分为多个|字符串并|存入列表|对象中"
lst = str1.split("|")
print(lst)

# 4.字符串的规整操作(去前后空格)
# 语法:字符串.strip()
str2 = "   gangendexin    "
str3 = str2.strip()
print(str3)
# 5.字符串的规整操作(去前后指定字符串)
# 语法:字符串.strip(字符串)

# 6.统计字符串中某字符串的出现次数
# 语法:字符串.count(字符串)

# 7.统计字符串的长度语法:len(字符串)

# 8.关于字符串的遍历就不再说明，同列表，元组方法一样
