# 序列是指:内容连续、有序，可使用下标索引的一类数据容器
# 列表、元组、字符串，均可以可以视为序列。

# 切片:从一个序列中，取出一个子序列
# 序列支持切片，即:列表、元组、字符串，均支持进行切片操作

# 语法:序列[起始下标:结束下标:步长]
#
# 表示从序列中，从指定位置开始，依次取出元素，到指定位置结束，得到一个新序列:
#
# 起始下标表示从何处开始，可以留空，留空视作从头开始
# 结束下标(不含)表示何处结束，可以留空，留空视作截取到结尾
# 步长表示，依次取元素的间隔
#
# 步长不写默认为1
# 步长1表示，一个个取元素
# 步长2表示，每次跳过1个元素取
# 步长N表示，每次跳过N-1个元素取
# 步长为负数表示，反向取(注意，起始下标和结束下标也要反向标记)

lst = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
# 不会影响到序列原本，而是会得到一个新的序列
lst1 = lst[0:19:3]
# [0, 3, 6, 9, 12, 15, 18]
print(lst1)
[20, 17, 14, 11, 8, 5, 2]
lst2 = lst[:1:-3]
print(lst2)