# 集合，最主要的特点就是:不支持元素的重复(自带去重功能)、并且内容无序

# 定义集合字面量
# {元素1,元素2,元素3,...,元素n}
# 定义集合变量
# 变量名称 = {元素1,元素2,元素3,...,元素n}
# 定义空集合
# 集合名称 = set()

{12,13,14,15,16,17,18,19,20,21,22}
st1 = {1,2,3,4,5}
st2 = set()
st3 = {"abc","def","ghi","daizhitong"}
st4 = {"abc","def","ghi","daizhitong","majiaqi","zhangzhenyuan","ikun"}
print(st1,type(st1))
print(st2,type(st2))
print(type({12,13,14,15,16,17,18,19,20,21,22}))
# 因为集合是无序的，所以下标没法用，你看到的顺序和实际顺序是不一样的     ---集合不支持下标索引访问
# 但是集合和列表一样，是允许修改的

# 1.添加新元素
# 语法:集合.add(元素)。将指定元素，添加到集合内
# 结果:集合本身被修改，添加了新元素
# st1.add(666)
# st3.add("这是一个添加元素")
# print(st1)
# print(st3)

# 2.移除元素
# 语法:集合.remove(元素)，将指定元素，从集合内移除
# 结果:集合本身被修改，移除了元素
# st3.remove("这是一个添加元素")
# print(st3)

# 3.从集合中随机取出元素
# 语法:集合.pop()，功能，从集合中随机取出一个元素
# 结果:会得到一个元素的结果。同时集合本身被修改，元素从集合中被移除
# a = st1.pop()
# print(a)
# print(st1)

# 4.清空集合
# 结果:集合本身被清空
# 语法:集合.clear()，功能，清空集合
# st1.clear()
# print(st1,type(st1))

# 5.取出2个集合的差集
# 语法:集合1.difference(集合2)，功能:取出集合1和集合2的差集(集合1有而集合2没有的)
# 结果:得到一个新集合，集合1和集合2不变
# st5 = st4.difference(st3)
# print(st5)

# 6.消除2个集合的差集
# 语法:集合1.difference_update(集合2)
# 功能:对比集合1和集合2，在集合1内，删除和集合2相同的元素。
# 结果:集合1被修改，集合2不变
# st4.difference_update(st3)
# print(st4)

# 7.2个集合合并
# 语法:集合1.union(集合2)
# 功能:将集合1和集合2组合成新集合
# 结果:得到新集合，集合1和集合2不变
# st6 = st4.union(st3)
# print(st6)

# 8.查看集合的元素数量
# 语法:len(集合)
# 功能:统计集合内有多少元素
# 结果:得到一个整数结果

# 集合同样支持使用for循环遍历
# 要注意:集合不支持下标索引，所以也就不支持使用while循环。
for i in st4:
    print(i)