# 数据容器可以从以下视角进行简单的分类:
#
#  是否支持下标索引
# ·支持:列表、元组、字符串-序列类型
# ·不支持:集合、字典-非序列类型
#
# 是否支持重复元素:
# ·支持:列表、元组、字符串一序列类型
# ·不支持:集合、字典一非序列类型
#
# 是否可以修改
# ·支持:列表、集合、字典
# ·不支持:元组、字符串

# 数据容器尽管各自有各自的特点，但是它们也有通用的一些操作。
#
# 1.首先，在遍历上:
# 5类数据容器都支持for循环遍历
# 列表、元组、字符串支持while循环，集合、字典不支持(无法下标索引)

# 2.数据容器的通用统计功能
# len(容器)
# 统计容器的元素个数
# max(容器)
# 统计容器的最大元素
# min(容器)
# 统计容器的最小元素

# 3.容器的通用转换功能
# list(容器)
# 将给定容器转换为列表
# str(容器)
# 将给定容器转换为字符串
# tuple(容器)
# 将给定容器转换为元组
# set(容器)
# 将给定容器转换为集合

# 4.通用排序功能
# sorted(容器, [reverse=True])
# 将给定容器进行排序
# 注意，排序后都会得到列表(list)对象。