# 一篇文章、一段视频、一个可执行程序，都可以被保存为一个文件，并赋予一个文件名。操作系统以文件为单位管理磁
# 盘中的数据。一般来说，文件可分为文本文件、视频文件、音频文件、图像文件、可执行文件等多种类别。

# 在日常生活中，文件操作主要包括打开、关闭、读、写等操作。

# 在Python，使用open函数，可以打开一个已经存在的文件，或者创建一个新文件，语法如下
#
# open(name, mode, encoding)
#
# name:是要打开的目标文件名的字符串(可以包含文件所在的具体路径)。
# mode:设置打开文件的模式(访问模式):只读、写入、追加等。
# encoding:编码格式(推荐使用UTF-8)

f = open("D:/python.txt","r",encoding = "utf-8")
# print(f.read())
# content = f.read()
# print(content)
# 注意:此时的f是openW

# r:以只读方式打开文件。文件的指针将会放在文件的开头。这是默认模式。
# w:打开一个文件只用于写入。如果该文件已存在则打开文件，并从开头开始编辑，原有内容会被删除。
#   如果该文件不存在，创建新文件。
# a:打开一个文件用于追加。如果该文件已存在，新的内容将会被写入到已有内容之后。
#   如果该文件不存在，创建新文件进行写入。函数的文件对象。

# 文件操作三大步:1 打开 2 读或写 3 关闭

# read方法:
# 文件对象.read(num)
# mum表示要从文件中读取的数据的长度(单位是字节)，如果没有传入num，那么就表示读取文件中所有的数据。

# readlines方法:
# readlines可以按照行的方式把整个文件中的内容进行一次性读取，并且返回的是一个列表，其中每一行的数据为一个元素。
lst = f.readlines()
print(lst)
print(type(lst))

# readline()方法:一次读取一行内容

# close()关闭文件对象
f.close()
# 最后通过close，关闭文件对象，也就是关闭对文件的占用
# 如果不调用close,同时程序没有停止运行，那么这个文件将一直被Python程序占用。